<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->insert([
            [
                'title' => 'компьютерная и офисная мебель',
                'slug'  => 'компьютерная и офисная мебель',
                'parent_id'    => 0,
            ],
            [
                'title' => 'столы и стулья',
                'slug'  => 'столы и стулья',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мягкая мебель',
                'slug'         => 'мягкая мебель',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мебель для хранения',
                'slug'         => 'мебель для хранения',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мебель для спальни',
                'slug'         => 'мебель для спальни',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мебель для кухни',
                'slug'         => 'мебель для кухни',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мебель для ванной',
                'slug'         => 'мебель для ванной',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'садовая мебель',
                'slug'         => 'садовая мебель',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'детская мебель',
                'slug'         => 'детская мебель',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'бескаркасная мебель',
                'slug'         => 'бескаркасная мебель',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'гарнитуры и комплекты',
                'slug'         => 'гарнитуры и комплекты',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'мебель для бизнеса',
                'slug'         => 'мебель для бизнеса',
                'parent_id'    => 0,
            ],
            [
                'title'        => 'компьютерные и офисные кресла',
                'slug'         => 'компьютерные и офисные кресла',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'компьютерные и письменные столы',
                'slug'         => 'компьютерные и письменные столы',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'офисные тумбы',
                'slug'         => 'офисные тумбы',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'офисные стулья',
                'slug'         => 'офисные стулья',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'ортопедические стулья',
                'slug'         => 'ортопедические стулья',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'подставки под ноги',
                'slug'         => 'подставки под ноги',
                'parent_id'    => 1,
            ],
            [
                'title'        => 'диваны',
                'slug'         => 'диваны',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'кресла кресла_мешки',
                'slug'         => 'кресла кресла_мешки',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'пуфики и банкетки',
                'slug'         => 'пуфики и банкетки',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'кресла-качалки',
                'slug'         => 'кресла-качалки',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'кухоные уголки',
                'slug'         => 'кухоные уголки',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'комплекты мягкой мебели',
                'slug'         => 'комплекты мягкой мебели',
                'parent_id'    => 2,
            ],
            [
                'title'        => 'стулья',
                'slug'         => 'стулья',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'барные и полубарные стулья',
                'slug'         => 'барные и полубарные стулья',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'складные стулья',
                'slug'         => 'складные стулья',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'обеденные группы',
                'slug'         => 'обеденные группы',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'журнальные и приставные столы',
                'slug'         => 'журнальные и приставные столы',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'туалетные столики и консоли',
                'slug'         => 'туалетные столики и консоли',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'табуретки',
                'slug'         => 'табуретки',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'комплектующие для столов и стульев',
                'slug'         => 'комплектующие для столов и стульев',
                'parent_id'    => 3,
            ],
            [
                'title'        => 'шкафы',
                'slug'         => 'шкафы',
                'parent_id'    => 4,
            ],
            [
                'title'        => 'комоды и тумбы',
                'slug'         => 'комоды и тумбы',
                'parent_id'    => 4,
            ],
            [
                'title'        => 'обувницы и вешалки',
                'slug'         => 'обувницы и вешалки',
                'parent_id'    => 4,
            ],
            [
                'title'        => 'полки и стеллажи',
                'slug'         => 'полки и стеллажи',
                'parent_id'    => 4,
            ],
            [
                'title'        => 'кровати',
                'slug'         => 'кровати',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'матрасы',
                'slug'         => 'матрасы',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'детские кровати',
                'slug'         => 'детские кровати',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'раскладушки',
                'slug'         => 'раскладушки',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'комплекты мебели для спальни',
                'slug'         => 'комплекты мебели для спальни',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'прикроватные тумбы',
                'slug'         => 'прикроватные тумбы',
                'parent_id'    => 5,
            ],
            [
                'title'        => 'кухонные уголки',
                'slug'         => 'кухонные уголки',
                'parent_id'    => 6,
            ],
            [
                'title'        => 'кухонные гарнитуры',
                'slug'         => 'кухонные гарнитуры',
                'parent_id'    => 6,
            ],
            [
                'title'        => 'кухонные модули',
                'slug'         => 'кухонные модули',
                'parent_id'    => 6,
            ],
            [
                'title'        => 'фартуки для кухни',
                'slug'         => 'фартуки для кухни',
                'parent_id'    => 6,
            ],
            [
                'title'        => 'столешницы и комплектующие',
                'slug'         => 'столешницы и комплектующие',
                'parent_id'    => 6,
            ],
            [
                'title'        => 'комплекты',
                'slug'         => 'комплекты',
                'parent_id'    => 7,
            ],
            [
                'title'        => 'тумбы',
                'slug'         => 'тумбы',
                'parent_id'    => 7,
            ],
            [
                'title'        => 'шкафы и пеналы',
                'slug'         => 'шкафы и пеналы',
                'parent_id'    => 7,
            ],
            [
                'title'        => 'стулья и кресла',
                'slug'         => 'стулья и кресла',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'садовые качели и аксессуары',
                'slug'         => 'садовые качели и аксессуары',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'подвесные кресла',
                'slug'         => 'подвесные кресла',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'комплекты садовой мебели',
                'slug'         => 'комплекты садовой мебели',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'лежаки и шезлонги',
                'slug'         => 'лежаки и шезлонги',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'скамейки',
                'slug'         => 'скамейки',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'садовые и пляжные зонты',
                'slug'         => 'садовые и пляжные зонты',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'тенты и шатры',
                'slug'         => 'тенты и шатры',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'столы для сада',
                'slug'         => 'столы для сада',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'диваны садовые',
                'slug'         => 'диваны садовые',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'качели и гамаки',
                'slug'         => 'качели и гамаки',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'сундуки садовые',
                'slug'         => 'сундуки садовые',
                'parent_id'    => 8,
            ],
            [
                'title'        => 'колыбели',
                'slug'         => 'колыбели',
                'parent_id'    => 9,
            ],
            [
                'title'        => 'парты и столы',
                'slug'         => 'парты и столы',
                'parent_id'    => 9,
            ],
            [
                'title'        => 'наборы детской мебели',
                'slug'         => 'наборы детской мебели',
                'parent_id'    => 9,
            ],
            [
                'title'        => 'стулья и табуреты',
                'slug'         => 'стулья и табуреты',
                'parent_id'    => 9,
            ],
            [
                'title'        => 'пеленальные комоды и столики',
                'slug'         => 'пеленальные комоды и столики',
                'parent_id'    => 9,
            ],
            [
                'title'        => 'бескаркасные диваны',
                'slug'         => 'бескаркасные диваны',
                'parent_id'    => 10,
            ],
            [
                'title'        => 'бескаркасные пуфы',
                'slug'         => 'бескаркасные пуфы',
                'parent_id'    => 10,
            ],
            [
                'title'        => 'кресла-мешки',
                'slug'         => 'кресла-мешки',
                'parent_id'    => 10,
            ],
            [
                'title'        => 'для гостиной',
                'slug'         => 'для гостиной',
                'parent_id'    => 11,
            ],
            [
                'title'        => 'для прихожей',
                'slug'         => 'для прихожей',
                'parent_id'    => 11,
            ],
            [
                'title'        => 'для спальни',
                'slug'         => 'для спальни',
                'parent_id'    => 11,
            ],
            [
                'title'        => 'мебельные модули',
                'slug'         => 'мебельные модули',
                'parent_id'    => 11,
            ],
            [
                'title'        => 'для торгового зала',
                'slug'         => 'для торгового зала',
                'parent_id'    => 12,
            ],
            [
                'title'        => 'для салонов красоты',
                'slug'         => 'для салонов красоты',
                'parent_id'    => 12,
            ],
            [
                'title'        => 'для тату-салона',
                'slug'         => 'для тату-салона',
                'parent_id'    => 12,
            ],
            [
                'title'        => 'для производства',
                'slug'         => 'для производства',
                'parent_id'    => 12,
            ],
            [
                'title'        => 'мебель для мероприятий',
                'slug'         => 'мебель для мероприятий',
                'parent_id'    => 12,
            ]
        ]);
    }
}
